In [1]:
import pandas as pd

In [2]:
orders=pd.read_table('http://bit.ly/chiporders')#Hotel orders data

In [3]:
movies=pd.read_table('http://bit.ly/movieusers')

In [4]:
movies.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

## The data is cluttered we have to mention the seperator manually

In [5]:
movies=pd.read_table('http://bit.ly/movieusers',sep='|')

In [6]:
movies.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

## We have to explicitly mention that there is no header it is taking one of the data sample as header

In [7]:
movies=pd.read_table('http://bit.ly/movieusers',sep='|',header=None)

In [8]:
movies.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

## We can give our manual headers names using 'names ' keyword

In [9]:
cols=['id','age','gender','position','zip_code']

movies=pd.read_table('http://bit.ly/movieusers',sep='|',header=None,names=cols)

In [10]:
movies.head()##Hola our data is ready

   id  age gender    position zip_code
0   1   24      M  technician    85711
1   2   53      F       other    94043
2   3   23      M      writer    32067
3   4   24      M  technician    43537
4   5   33      F       other    15213

## UFO report

In [11]:
ufo=pd.read_csv('http://bit.ly/uforeports',sep=',')

In [12]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [13]:
type(ufo)

pandas.core.frame.DataFrame

## In Dataframe the features(cols) in the dataframe are the attributes of the Dataframe

In [14]:
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
5                 Valley City
6                 Crater Lake
7                        Alma
8                     Eklutna
9                     Hubbard
10                    Fontana
11                   Waterloo
12                     Belton
13                     Keokuk
14                  Ludington
15                Forest Home
16                Los Angeles
17                  Hapeville
18                     Oneida
19                 Bering Sea
20                   Nebraska
21                        NaN
22                        NaN
23                  Owensboro
24                 Wilderness
25                  San Diego
26                 Wilderness
27                     Clovis
28                 Los Alamos
29               Ft. Duschene
                 ...
18211                 Holyoke
18212                  Carson
18213                Pasadena
18214                  Austin
18215                El Campo
18216            Garden Grove
18217           Berthoud Pass
18218              Sisterdale
18219            Garden Grove
18220             Shasta Lake
18221                Franklin
18222          Albrightsville
18223              Greenville
18224                 Eufaula
18225             Simi Valley
18226           San Francisco
18227           San Francisco
18228              Kingsville
18229                 Chicago
18230             Pismo Beach
18231             Pismo Beach
18232                    Lodi
18233               Anchorage
18234                Capitola
18235          Fountain Hills
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

## Data operation using Pandas

In [15]:
data=pd.read_csv('house.csv')

In [16]:
data.head(5)

         Date     Value
0  2018-08-31  0.045806
1  2018-07-31  0.044487
2  2018-06-30  0.042498
3  2018-05-31  0.041237
4  2018-04-30  0.042663

In [17]:
data.set_index('Date',inplace=True)

In [18]:
data.to_csv('cool.csv')

In [19]:
data=pd.read_csv('house.csv',names=['Date','Austin'],index_col=0)

In [21]:
data.head()

                       Austin
Date
Date                    Value
2018-08-31  0.045806451612903
2018-07-31  0.044487427466151
2018-06-30  0.042498390212492
2018-05-31  0.041237113402062

## 10 mins official pandas tutorial

In [24]:
#Creating a Series  Dataframe from Array
choclate=["Kit-kat","Dairmilk","Oreo"]
series=pd.Series(data=choclate)

In [25]:
series.head()

0     Kit-kat
1    Dairmilk
2        Oreo
dtype: object

## Operating with Timeseries data

In [28]:
time=pd.date_range('20180101',periods=6)

In [29]:
time

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [30]:
import numpy as np
time_data=pd.DataFrame(np.random.randn(6,4),index=time,columns=list('ABCD'))

In [31]:
time_data.head()

                   A         B         C         D
2018-01-01 -0.423856  0.361650 -0.286091  2.099944
2018-01-02 -0.441210 -0.407743 -1.349547 -1.465726
2018-01-03  1.246966 -1.303420 -1.130023  0.908044
2018-01-04  0.388437 -0.830453 -0.385453  0.408443
2018-01-05 -0.694854 -1.145218  1.146375 -2.601958